In [1]:
import os
import numpy as np
import pandas as pd

In [2]:
os.chdir("C:\\Users\\Thispc\\Desktop\\python\\carpred\\wikipedia-data")

In [3]:
df= pd.read_csv('femaleadjectives.csv')

In [4]:
mdf= pd.read_csv('maleadjectives.csv')

In [5]:
df.shape

(5057, 7)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5057 entries, 0 to 5056
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   1970        5057 non-null   int64
 1   [young]     5057 non-null   object
 2   Unnamed: 2  199 non-null    object
 3   Unnamed: 3  31 non-null     object
 4   Unnamed: 4  11 non-null     object
 5   Unnamed: 5  3 non-null      object
 6   Unnamed: 6  2 non-null      object
dtypes: int64(1), object(6)
memory usage: 276.7+ KB

In [7]:
df1=df.drop_duplicates()

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1104 entries, 0 to 5056
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   1970        1104 non-null   int64
 1   [young]     1104 non-null   object
 2   Unnamed: 2  194 non-null    object
 3   Unnamed: 3  31 non-null     object
 4   Unnamed: 4  11 non-null     object
 5   Unnamed: 5  3 non-null      object
 6   Unnamed: 6  2 non-null      object
dtypes: int64(1), object(6)
memory usage: 69.0+ KB

In [9]:
df1.set_axis(['year','category1','category2','category3','category4','category5','category6'],axis='columns',inplace=True)
df1

,year,category1,category2,category3,category4,category5,category6
0,1970,[],NaN,NaN,NaN,NaN,NaN
3,1970,[unrecognizable],NaN,NaN,NaN,NaN,NaN
8,1970,[sister],NaN,NaN,NaN,NaN,NaN
17,1970,[real],NaN,NaN,NaN,NaN,NaN
20,1970,[young],NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...
5030,2007,[beautiful,captivating],NaN,NaN,NaN,NaN
5034,2008,[widowed],NaN,NaN,NaN,NaN,NaN
5043,2008,[Indian],NaN,NaN,NaN,NaN,NaN
5055,1971,[long],NaN,NaN,NaN,NaN,NaN
5056,1971,[beautiful],NaN,NaN,NaN,NaN,NaN

In [10]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1104 entries, 0 to 5056
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   year       1104 non-null   int64
 1   category1  1104 non-null   object
 2   category2  194 non-null    object
 3   category3  31 non-null     object
 4   category4  11 non-null     object
 5   category5  3 non-null      object
 6   category6  2 non-null      object
dtypes: int64(1), object(6)
memory usage: 69.0+ KB

In [11]:
df1=df1.fillna(np.nan).replace([np.nan], [None])

In [12]:
df1['year'].value_counts()

2010    41
2015    38
2006    38
2014    38
2016    37
2013    36
2007    36
2003    35
2005    34
2002    34
2008    34
2011    32
1985    31
2012    29
1983    29
1991    27
1993    27
2001    26
1999    26
1997    25
2009    21
1988    20
2004    20
1998    20
1994    20
1972    19
1982    19
1977    19
1992    18
1974    18
1973    18
1996    17
2000    17
1980    17
1976    16
1979    15
1986    15
1970    14
1987    14
1984    14
1981    14
1978    13
1975    13
2017    13
1995    13
1990    12
1989    12
1971    10
Name: year, dtype: int64

In [13]:
df1['category1'].value_counts()

[]               48
[young]          43
[beautiful]      34
[young           31
[beautiful       29
                 ..
[subordinate]     1
[obsessive]       1
[exotic]          1
[remorseless]     1
[flat]            1
Name: category1, Length: 465, dtype: int64

In [14]:
df1['category2'].value_counts()

 young]          31
 young            6
 simple]          5
 twin]            5
 real]            5
                 ..
 idealistic]      1
 persistent       1
 blonde           1
 happy            1
 captivating]     1
Name: category2, Length: 111, dtype: int64

In [15]:
df1['category3'].value_counts()

 young]            5
 little]           2
 rich]             2
 married]          1
 fun]              1
 different]        1
 lone              1
 Ideal             1
 true              1
 sheltered         1
 sweet             1
 right             1
 Pakistani]        1
 twin              1
 compassionate]    1
 pregnant]         1
 hermit]           1
 authentic         1
 dignified]        1
 unmarried]        1
 short             1
 worthy            1
 unaware]          1
 soft]             1
 innocent          1
Name: category3, dtype: int64

In [16]:
df1['category4'].value_counts()

 nameless]      1
 aggressive]    1
 missing        1
 little]        1
 sweet]         1
 dreamy]        1
 liberal]       1
 real]          1
 Indian         1
 good]          1
 kiddish        1
Name: category4, dtype: int64

In [17]:
df1['category5'].value_counts()

 pure          1
 decent]       1
 motherless    1
Name: category5, dtype: int64

In [18]:
df1['category6'].value_counts()

 good]       1
 playful]    1
Name: category6, dtype: int64

In [19]:
df1.describe()

              year
count  1104.000000
mean   1997.242754
std      13.576783
min    1970.000000
25%    1985.000000
50%    2000.000000
75%    2009.000000
max    2017.000000

In [20]:
import category_encoders as ce

In [21]:
X=df1.drop('year',axis=1)
Y=df1['year']

In [22]:
from sklearn.model_selection import train_test_split
X_train, X_test,y_train,y_test =train_test_split(X,Y, test_size=0.40)

In [23]:
X_train.shape,X_test.shape,y_train.shape,y_test.shape

((662, 6), (442, 6), (662,), (442,))

In [24]:
X_train.head(10)

         category1 category2 category3 category4 category5 category6
862          [new]      None      None      None      None      None
3794       [blind]      None      None      None      None      None
2902  [undercover]      None      None      None      None      None
931       [little]      None      None      None      None      None
409    [religious]      None      None      None      None      None
1884     [popular]      None      None      None      None      None
3464   [unwilling]      None      None      None      None      None
2905       [young]      None      None      None      None      None
1899     [widowed]      None      None      None      None      None
395     [princess]      None      None      None      None      None

In [25]:
encoder = ce.OrdinalEncoder(cols=['category1', 'category2', 'category3', 'category4', 'category5','category6'])


X_train = encoder.fit_transform(X_train)

X_test = encoder.transform(X_test)

In [26]:
from sklearn.ensemble import RandomForestRegressor
regressor_rf = RandomForestRegressor(random_state=42)

In [27]:
regressor_rf.fit(X_train,y_train)

RandomForestRegressor(random_state=42)

In [28]:
y_pred = regressor_rf.predict(X_test)
y_pred

array([1991.93668403, 1992.42056746, 1996.15139026, 1992.8179397 ,
       1994.60775699, 1996.15139026, 1991.93668403, 1981.47      ,
       1991.63091497, 2010.72      , 1996.15139026, 1994.98108403,
       1996.15139026, 1999.20771157, 1996.15139026, 1996.15139026,
       1996.15139026, 1994.98108403, 1996.15139026, 1996.15139026,
       1996.19888095, 1996.15139026, 1996.15139026, 1996.15139026,
       1992.8179397 , 1991.93668403, 1990.47      , 1996.15139026,
       2002.57      , 1994.60775699, 1996.15139026, 1993.86333333,
       1996.15139026, 2000.20028914, 1991.738     , 1996.15139026,
       1990.86677778, 2000.20616667, 1996.15139026, 2005.91133333,
       1988.        , 1996.15139026, 1994.5768967 , 1996.15139026,
       1996.15139026, 1994.98108403, 1982.69791667, 1993.22297899,
       2000.20028914, 1996.0265119 , 1996.15139026, 1996.15139026,
       1985.91526062, 1995.31      , 1988.38908333, 1994.5768967 ,
       2002.68      , 1996.15139026, 2000.20028914, 1998.6810873 ,
       1981.47      , 2002.17      , 1997.57      , 1996.15139026,
       1996.15139026, 1981.47      , 1993.22297899, 1992.50579762,
       1986.24091667, 1996.15139026, 1994.98108403, 1994.98108403,
       1996.15139026, 2004.4       , 1996.15139026, 1988.38908333,
       2009.315     , 2001.95667063, 1994.60775699, 2000.20616667,
       1992.50579762, 1996.15139026, 2002.95736508, 1982.97592857,
       1986.24091667, 1996.15139026, 1996.15139026, 1990.86677778,
       1994.87592697, 1994.87592697, 1996.0265119 , 1994.5768967 ,
       1994.5768967 , 1994.37122149, 2009.47946825, 1996.15139026,
       1996.15139026, 1994.72388095, 1992.8179397 , 1996.15139026,
       1994.60775699, 1999.20771157, 2000.035     , 2001.95667063,
       1994.98108403, 1989.68450397, 1996.15139026, 1988.706     ,
       2008.63166667, 1986.24091667, 1997.82      , 2004.054     ,
       1989.05      , 2000.20028914, 2006.77      , 1998.6810873 ,
       2006.48333333, 1996.15139026, 1996.15139026, 1994.72388095,
       1994.34642262, 1994.98108403, 1998.675     , 1994.60775699,
       2002.68      , 1999.20771157, 1991.63091497, 1996.15139026,
       2006.68765337, 1999.99060876, 2003.11569841, 1998.02566667,
       1978.42362477, 2008.42      , 1993.547921  , 1994.60775699,
       2006.68765337, 1996.87365488, 1992.8179397 , 1996.15139026,
       1996.15139026, 2006.77      , 1990.1964265 , 1995.59      ,
       1996.15139026, 1991.63091497, 1992.47      , 1992.8179397 ,
       1996.15139026, 1994.60775699, 2004.978     , 2001.95667063,
       1992.8179397 , 2005.08966667, 1996.15139026, 1995.77      ,
       1996.15139026, 1996.15139026, 1994.87592697, 1996.15139026,
       1990.1964265 , 1991.4714816 , 2002.57      , 2001.57542857,
       1991.67511926, 1996.15139026, 1991.4714816 , 1996.15139026,
       1996.15139026, 1979.8552381 , 1996.15139026, 1994.98108403,
       1988.37641667, 1996.15139026, 1989.89957143, 1986.51      ,
       1992.8179397 , 1997.70363187, 1996.15139026, 1996.15139026,
       1988.34      , 1993.87      , 2006.68765337, 1996.15139026,
       1996.15139026, 1996.15139026, 2004.054     , 1992.50579762,
       2005.45583333, 1992.8179397 , 1996.15139026, 1996.15139026,
       1994.98108403, 1996.87365488, 1992.8179397 , 1985.91526062,
       1981.71516667, 1996.15139026, 1994.37122149, 1994.5768967 ,
       1996.15139026, 1990.98333333, 1996.15139026, 1996.15139026,
       2006.68765337, 1996.15139026, 1996.15139026, 1992.8179397 ,
       1999.7       , 2003.175     , 1994.98108403, 1994.37122149,
       1996.15139026, 1996.15139026, 1996.15139026, 1994.5768967 ,
       1993.97      , 1996.0265119 , 1995.59      , 1996.15139026,
       1996.15139026, 1994.72388095, 1994.37122149, 1994.98108403,
       1994.37122149, 1996.149     , 1990.1964265 , 1991.93668403,
       1992.8179397 , 1991.93668403, 1996.15139026, 1989.68450397,
       1996.15139026, 1994.98108403, 2001.09      , 1989.89957143,
       2006.68765337, 1996.15139026, 1992.8179397 , 1996.15139026,
       1990.34933333, 1993.86333333, 2001.12314286, 2006.48333333,
       1991.67511926, 1996.15139026, 1998.60707308, 1996.15139026,
       1994.37122149, 2011.631     , 1998.19      , 2000.20616667,
       1981.47      , 1994.55      , 1996.15139026, 1996.15139026,
       1994.60775699, 1991.63091497, 1996.70583333, 2000.20028914,
       1996.15139026, 1989.99      , 1992.8179397 , 1996.15139026,
       1994.60775699, 1991.67511926, 1996.15139026, 1994.98108403,
       1996.15139026, 1996.15139026, 1994.34642262, 2000.8575    ,
       1996.15139026, 1996.70583333, 1991.93668403, 1994.87592697,
       1994.37122149, 1996.15139026, 1996.15139026, 1990.1964265 ,
       1996.01105665, 1994.98108403, 2000.20616667, 1996.15139026,
       1994.65266667, 1994.5768967 , 2000.20028914, 1994.98108403,
       1994.34642262, 1996.15139026, 1996.15139026, 1990.86677778,
       1994.60775699, 1994.5768967 , 1991.11571429, 2005.45583333,
       1991.6304329 , 1996.87365488, 2000.29335714, 1996.15139026,
       1994.37122149, 1978.65      , 1996.15139026, 1999.43928571,
       1996.15139026, 2005.928     , 1986.72      , 1994.37122149,
       1997.11883333, 1990.34933333, 1997.45029258, 1985.91526062,
       1999.20771157, 1994.72388095, 1996.15139026, 1993.415     ,
       1996.15139026, 1998.60707308, 1992.8179397 , 1996.15139026,
       1994.60775699, 1996.15139026, 1996.15139026, 1996.15139026,
       1996.15139026, 2000.55      , 2008.63166667, 1996.15139026,
       1996.15139026, 1997.20029258, 1992.50579762, 1990.98333333,
       1991.67511926, 1996.15139026, 1996.15139026, 2006.68765337,
       1994.72388095, 1994.98108403, 1999.20771157, 2006.68765337,
       1993.22297899, 1988.18      , 2008.44165079, 1996.84      ,
       1992.98416667, 1994.87592697, 2000.29335714, 2004.79      ,
       1996.15139026, 1994.60775699, 1994.98108403, 1996.15139026,
       1996.15139026, 1996.15139026, 1994.60775699, 1996.15139026,
       1998.76      , 1996.15139026, 1999.20771157, 2003.43466667,
       1994.60775699, 2008.44165079, 1996.15139026, 1996.15139026,
       1996.15139026, 1994.5768967 , 2007.5       , 1994.34642262,
       2000.20616667, 1991.69655159, 1991.63091497, 1989.99      ,
       1992.8179397 , 1996.15139026, 1996.15139026, 1996.15139026,
       1996.15139026, 1996.15139026, 1998.01194841, 2000.20028914,
       1990.1964265 , 1996.15139026, 1992.8179397 , 1992.8179397 ,
       2003.685     , 1996.15139026, 2009.678     , 1996.15139026,
       1996.01105665, 1996.15139026, 2006.5325    , 2002.57      ,
       1996.149     , 1996.55761905, 1994.60775699, 1996.15139026,
       1996.15139026, 1991.67511926, 1996.15139026, 1996.15139026,
       1996.15139026, 1992.8179397 , 1991.93668403, 2011.631     ,
       1994.87592697, 1996.15139026, 1996.15139026, 1990.47      ,
       1996.15139026, 1996.15139026, 1996.15139026, 1996.15139026,
       1991.67511926, 1996.15139026, 1993.22297899, 1991.67511926,
       1994.98108403, 1996.15139026, 2003.175     , 2008.97      ,
       1993.22018473, 1996.15139026, 1981.71      , 1992.8179397 ,
       1998.19      , 1996.84      , 1986.24091667, 1996.15139026,
       2000.20616667, 1992.50579762, 1985.91526062, 1991.93668403,
       1994.5768967 , 1996.15139026, 1996.15139026, 1996.15139026,
       1985.77183333, 1991.93668403, 1996.15139026, 1992.8179397 ,
       1991.58      , 1996.15139026])

In [29]:
cutoff = 0.6                             
y_pred_classes = np.zeros_like(y_pred)    
y_pred_classes[y_pred > cutoff] = 1  
y_test_classes = np.zeros_like(y_pred)
y_test_classes[y_test > cutoff] = 1

In [30]:
from sklearn.metrics import accuracy_score
female=(accuracy_score(y_test_classes,y_pred_classes))

In [31]:
female

1.0

In [32]:
df2=mdf.set_axis(['year','category1','category2','category3','category4','category5','category6'],axis='columns',inplace=True)
df2

In [33]:
df2=mdf.drop_duplicates()

In [34]:
df2.describe()

              year
count  1589.000000
mean   1997.556325
std      13.332462
min    1970.000000
25%    1987.000000
50%    1999.000000
75%    2009.000000
max    2017.000000

In [35]:
X=df2.drop('year',axis=1)
Y=df2['year']

In [36]:
from sklearn.model_selection import train_test_split
X_train, X_test,y_train,y_test =train_test_split(X,Y, test_size=0.40)

In [37]:
X_train.shape,X_test.shape,y_train.shape,y_test.shape

((953, 6), (636, 6), (953,), (636,))

In [38]:
encoder = ce.OrdinalEncoder(cols=['category1', 'category2', 'category3', 'category4', 'category5','category6'])
X_train = encoder.fit_transform(X_train)
X_test = encoder.transform(X_test)

In [39]:
from sklearn.ensemble import RandomForestClassifier
c_rf = RandomForestClassifier(random_state=42)

In [40]:
c_rf.fit(X_train,y_train)

RandomForestClassifier(random_state=42)

In [41]:
y_pred = c_rf.predict(X_test)
y_pred

array([1994, 1993, 1993, 1990, 1990, 2010, 1990, 1992, 2009, 1990, 1990,
       2012, 1992, 1990, 2013, 1993, 1996, 1993, 2009, 1986, 2015, 1990,
       1971, 1990, 2003, 2005, 2004, 2017, 2005, 2015, 2004, 1990, 2005,
       2003, 1990, 1990, 1990, 1990, 1990, 1990, 2006, 1990, 2011, 2013,
       2015, 2003, 1990, 1977, 1986, 1990, 1972, 2002, 2008, 1990, 1990,
       2003, 1990, 1971, 2001, 1971, 1990, 2016, 1990, 1990, 2015, 1992,
       1992, 1987, 1993, 1997, 1985, 1996, 1986, 2003, 2009, 2008, 2012,
       2013, 2015, 1990, 1990, 1986, 2015, 1990, 1992, 2011, 1999, 1993,
       1999, 1990, 2015, 1997, 2011, 1990, 1980, 2015, 2007, 2014, 1990,
       1976, 1990, 1990, 1990, 1992, 2004, 1990, 2010, 1992, 2006, 1990,
       1990, 1980, 1990, 1990, 1999, 1999, 1990, 1990, 1990, 1987, 2011,
       2007, 1972, 1993, 1990, 1999, 2005, 1987, 1990, 1990, 1990, 1999,
       1985, 2007, 1986, 2013, 1990, 1993, 1990, 1990, 1990, 1990, 1994,
       2012, 1994, 1983, 1990, 1999, 1990, 2004, 2010, 1986, 1971, 1996,
       2010, 2005, 1996, 2007, 1990, 2005, 1986, 1983, 1990, 1996, 2010,
       1990, 1982, 2015, 1999, 1990, 1990, 1990, 1976, 1998, 1990, 2010,
       1990, 1971, 1990, 2010, 1990, 1993, 1993, 1990, 1993, 1990, 1990,
       1990, 2011, 2007, 1990, 1972, 1990, 2003, 1972, 1990, 1990, 1975,
       2007, 1990, 2005, 1979, 1990, 1992, 2009, 1990, 2005, 1997, 1990,
       2004, 1990, 1977, 1990, 1990, 2009, 2016, 1990, 1990, 1987, 1996,
       2006, 2005, 1990, 1990, 1990, 1990, 1990, 1999, 1982, 1990, 2009,
       1984, 2003, 2004, 1990, 1992, 1990, 1990, 1992, 1992, 1990, 1990,
       1990, 1996, 1993, 1996, 2007, 2011, 2003, 1990, 2015, 2007, 1992,
       1990, 1990, 1982, 1990, 1984, 1999, 1990, 1990, 2007, 1990, 2007,
       1990, 1994, 1990, 1979, 1972, 1990, 2006, 1999, 2010, 1979, 2005,
       1987, 2015, 1987, 1990, 2004, 2002, 1990, 2011, 1990, 1990, 1990,
       1987, 1989, 2013, 2003, 2011, 1990, 1992, 1992, 2013, 2010, 1982,
       1997, 1990, 2005, 2015, 2012, 1990, 1972, 2015, 1992, 1993, 1990,
       1990, 2005, 1990, 2012, 1999, 2007, 1992, 1990, 1996, 2013, 1990,
       2011, 1983, 1990, 1990, 2006, 1988, 1990, 2004, 1992, 1996, 1988,
       1987, 1991, 2012, 2005, 2002, 2009, 1990, 1990, 1990, 1997, 1990,
       2003, 2005, 1972, 1990, 1990, 1990, 1990, 1990, 1990, 1999, 1990,
       1990, 1992, 2010, 2011, 1992, 1999, 2015, 2005, 2011, 2006, 2002,
       1983, 1990, 1993, 1990, 1972, 1990, 1990, 1992, 1990, 1999, 1990,
       1990, 1993, 1999, 1999, 1990, 2012, 1999, 1990, 1990, 1990, 2010,
       1993, 1987, 1994, 1998, 1990, 1987, 1990, 1992, 1979, 2011, 1990,
       2005, 2005, 1990, 1996, 1994, 1990, 2008, 1999, 1990, 1977, 1999,
       1980, 1990, 2012, 1990, 2007, 1990, 1990, 1992, 1996, 1990, 1971,
       1990, 1992, 1990, 1990, 1990, 1990, 2015, 1990, 1999, 2008, 1986,
       1990, 2015, 1980, 1987, 2004, 1990, 2012, 1972, 1990, 1990, 2003,
       1990, 1997, 2005, 1986, 1996, 1977, 1990, 1990, 2003, 1993, 1999,
       1990, 1993, 2007, 1994, 1993, 1982, 2006, 2005, 2011, 1990, 1993,
       1990, 1982, 1990, 1990, 2009, 1990, 1984, 1990, 1977, 1990, 1986,
       1990, 1990, 1986, 2005, 2003, 1992, 1997, 1999, 1988, 2005, 1990,
       1999, 1990, 1990, 1992, 2011, 1990, 1995, 1994, 1997, 1990, 1990,
       2008, 1992, 1993, 1990, 1990, 2015, 2013, 2005, 1972, 1987, 1980,
       1986, 1990, 1990, 1986, 1990, 1990, 2003, 2010, 2007, 2010, 1993,
       1990, 1997, 1990, 1990, 2004, 1990, 2013, 1990, 1990, 1972, 1990,
       2005, 2005, 1993, 1986, 1990, 1990, 2011, 1990, 1993, 1990, 1993,
       1997, 1987, 1990, 1995, 2005, 1990, 1990, 1987, 1990, 1990, 2003,
       1990, 2005, 2006, 2010, 2011, 1990, 1999, 1996, 2004, 2005, 1999,
       2005, 1990, 2005, 1992, 1999, 2006, 1992, 2004, 1991, 2016, 1997,
       2005, 1990, 1990, 1992, 1993, 1972, 2012, 1996, 1990, 1990, 1990,
       1990, 1986, 1990, 1971, 1997, 1990, 1990, 2017, 1990, 1990, 1990,
       1995, 1987, 1990, 1990, 1993, 1990, 2005, 1990, 2004, 2001, 2012,
       1990, 1992, 2012, 1977, 1997, 1990, 2016, 1990, 1981, 1997, 2004,
       1990, 1990, 2004, 1990, 1992, 1995, 1972, 1990, 1992, 2004, 1990,
       1990, 2007, 1982, 1990, 1990, 1997, 1972, 1990, 1990], dtype=int64)

In [42]:
from sklearn.metrics import accuracy_score
male=(accuracy_score(y_test,y_pred))

In [43]:
male

0.014150943396226415

In [44]:
import datacompy

In [45]:
compare = datacompy.Compare(df1,df2,join_columns='year')

C:\Users\Thispc\AppData\Roaming\Python\Python39\site-packages\datacompy\core.py:259: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.df2[order_column] = generate_id_within_group(
C:\Users\Thispc\AppData\Roaming\Python\Python39\site-packages\datacompy\core.py:290: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.df2.drop(order_column, axis=1, inplace=True)

In [46]:
print(compare.report())

DataComPy Comparison
--------------------

DataFrame Summary
-----------------

  DataFrame  Columns  Rows
0       df1        7  1104
1       df2        7  1589

Column Summary
--------------

Number of columns in common: 7
Number of columns in df1 but not in df2: 0
Number of columns in df2 but not in df1: 0

Row Summary
-----------

Matched on: year
Any duplicates on match values: Yes
Absolute Tolerance: 0
Relative Tolerance: 0
Number of rows in common: 1,075
Number of rows in df1 but not in df2: 29
Number of rows in df2 but not in df1: 514

Number of rows with some compared columns unequal: 1,036
Number of rows with all compared columns equal: 39

Column Comparison
-----------------

Number of columns compared with some values unequal: 6
Number of columns compared with all values equal: 1
Total number of values which compare unequal: 1,457

Columns with Unequal Values or Types
------------------------------------

      Column df1 dtype df2 dtype  # Unequal  Max Diff  # Null Diff
0  category1    object    object       1032         0            0
1  category2    object    object        337         0          307
2  category3    object    object         65         0           64
3  category4    object    object         17         0           17
4  category5    object    object          4         0            4
5  category6    object    object          2         0            2

Sample Rows with Unequal Values
-------------------------------

      year category1 (df1) category1 (df2)
176   1983          [rich]      [faithful]
485   2003        [common]          [rich]
273   1991        [sister]              []
642   2010        [lovely]      [lifeless]
407   2000     [distressed        [common]
911   1980        [Indian]         [angry]
1075  2003         [elder]          [Holy]
185   1984       [budding]         [young]
278   1991           [ill]       [deceased
60    1976     [unmarried]        [greedy]

     year category2 (df1) category2 (df2)
687  2015            None         secure]
339  1996            None         wealthy
986  1993            new]             NaN
729  2013         ailing]             NaN
248  1988           poor]          burly]
502  2004            None           rich]
856  1994         orphan]             NaN
854  1994          young]           real]
921  2014            None    intelligent]
410  2000            None       paranoid]

      year  category3 (df1) category3 (df2)
399   1999   compassionate]     uneducated]
790   2010             None        vicious]
500   2004             None          Alone]
27    1973         married]             NaN
1041  1998         innocent             NaN
361   1997        authentic             NaN
699   2014             None   unsuccessful]
245   1988          little]             NaN
645   2011             None          naive]
701   2014           young]             NaN

     year category4 (df1) category4 (df2)
522  2005            None           twin]
603  2008          sweet]             NaN
382  1999            None       Pakistani
705  2014        liberal]             NaN
361  1997         missing             NaN
449  2002         little]             NaN
164  1983       nameless]             NaN
716  2014           real]             NaN
189  1985            None           rich]
610  2008         dreamy]             NaN

      year category5 (df1) category5 (df2)
1041  1998      motherless             NaN
361   1997            pure             NaN
746   2012         decent]             NaN
382   1999            None        spoiled]

      year category6 (df1) category6 (df2)
1041  1998        playful]             NaN
361   1997           good]             NaN

Sample Rows Only in df1 (First 10 Columns)
------------------------------------------

      year       category1 category2 category3 category4 category5 category6
875   1974          [poor]      None      None      None      None      None
869   1974        [female]      None      None      None      None      None
1057  2001        [second]      None      None      None      None      None
97    1978       [general]      None      None      None      None      None
942   1983       [adopted]      None      None      None      None      None
943   1983           [new]      None      None      None      None      None
868   1974  [disheartened]      None      None      None      None      None
1066  2002           [dead    local]      None      None      None      None
849   1973          [poor]      None      None      None      None      None
848   1973    [challenged]      None      None      None      None      None

Sample Rows Only in df2 (First 10 Columns)
------------------------------------------

      year      category1 category2 category3 category4 category5 category6
1386  1994  [millionaire]       NaN       NaN       NaN       NaN       NaN
1529  1997  [distracting]       NaN       NaN       NaN       NaN       NaN
1320  2009       [bereft]       NaN       NaN       NaN       NaN       NaN
1248  2003         [holy]       NaN       NaN       NaN       NaN       NaN
1411  2012    [chartered]       NaN       NaN       NaN       NaN       NaN
1317  2010       [famous]       NaN       NaN       NaN       NaN       NaN
1286  2013     [scheming]       NaN       NaN       NaN       NaN       NaN
1265  2005     [disabled]       NaN       NaN       NaN       NaN       NaN
1210  1992     [longtime]       NaN       NaN       NaN       NaN       NaN
1531  1997    [reluctant]       NaN       NaN       NaN       NaN       NaN